Repository: open-data/ckanext-recombinant
Catalog: ckanext/recombinant/i18n/*/LC_MESSAGES/recombinant.po
Languages: fr

source: Your file was successfully uploaded into the central system.
fr: Votre fichier a été téléchargé avec succès dans le système central.

source: {num} deleted.
fr: {num} supprimé

source: The server encountered a problem processing the file uploaded. Please try copying your data into the latest version of the template and uploading again. If this problem continues, send your Excel file to open-ouvert@tbs-sct.gc.ca so we may investigate.
fr: Le serveur a éprouvé un problème dans le traitement du fichier qui a été téléchargé. Veuillez tenter de copier vos données dans la version la plus récente du modèle et de télécharger le tout de nouveau. Si ce problème persiste, envoyez votre fichier Excel à open-ouvert@… afin que nous puissions faire enquête.

source: Invalid sheet for this organization. Sheet must be labeled for {0}, but you supplied a sheet for {1}
fr: La feuille n'est pas valide pour cette organisation. La feuille doit être étiquetée pour {0}, mais vous avez fourni une feuille pour {1}

source: Are you sure you want to delete {num} record? This action cannot be undone.
fr: Souhaitez-vous vraiment supprimer {num} demande? Cette action ne peut pas être annulée.

source: row
fr: ligne

source: rows
fr: lignes

source: Reference
fr: Référence

source: API Access
fr: Accès par API

source: API access examples
fr: Exemples d’accès par API

source: Retrieve Records
fr: Récupérer un dossier

source: Access this data through the <a href="http://docs.ckan.org/en/latest/maintaining/datastore.html#the-datastore-api" >CKAN Datastore API</a> with <code>resource_id="%(resource_id)s"</code>
fr: Accéder à ces données par <a href="http://docs.ckan.org/en/latest/maintaining/datastore.html#the-datastore-api" >l’API de mémoire de données CKAN</a> avec <code>resource_id="%(resource_id)s"</code>

source: The CKAN API uses a JSON-RPC style, where you post a JSON object and receive another JSON object in response.
fr: L’API CKAN utilise un style JSON-RPC, par lequel on inscrit un objet JSON et on reçoit en réponse un autre objet JSON.

source: Example:
fr: Exemple :

source: Create and Update Records
fr: Créer et mettre à jour un dossier

source: Modifying records requires an API key. Your API key is shown on your <a href="%(profile_url)s">profile page</a>.
fr: La modification d’un dossier exige une clé API. Votre clé API apparaît dans votre <a href="%(profile_url)s">page de profil</a>.

source: Do not include your API key in any code shared with other people. Use a configuration file or environment variable to let each user input their own key when they use your tool. Your API key is <em>equivalent to your password</em> and may be used to perform any action your user can on this site. All actions made with your API key will be logged as actions you performed.
fr: N’insérez jamais votre clé API dans un code partagé avec d’autres personnes. Utilisez un fichier de configuration ou une variable d’environnement pour permettre à chaque utilisateur d’entrer sa propre clé lorsqu’il utilise votre outil. Votre clé API équivaut à votre mot de passe et peut être utilisée pour n’importe quelle action que peut exécuter votre utilisateur sur ce site. Toutes les actions effectuées à partir de votre clé API seront inscrites à votre nom.

source: Create and update records with the "datastore_upsert" endpoint. Your API key must be sent as an "Authorization" header.
fr: Pour créer ou mettre à jour des dossiers, utilisez le point de terminaison « datastore_upsert ». Votre clé API doit être transmise comme en-tête « Authorization ».

source: Delete Records
fr: Supprimer un dossier

source: Deleting records requires an API key. Your API key is shown on your <a href="%(profile_url)s">profile page</a>.
fr: La suppression d’un dossier exige une clé API. Votre clé API apparaît dans votre <a href="%(profile_url)s">page de profil</a>.

source: First verify that the record you would like to remove is present with the "datastore_search" endpoint
fr: Vérifiez d’abord que le dossier que vous voulez supprimer apparaît avec le point de terminaison « datastore_search ».

source: Remove the record returned by passing the same parameters to the "datastore_delete" endpoint instead of "datastore_search".
fr: Supprimez le dossier retourné en appliquant les mêmes paramètres au point de terminaison « datastore_delete » plutôt que « datastore_search ».

source: If you have modified these API Access instructions for another programming language please send them to <a href="mailto:open-ouvert@tbs-sct.gc.ca">open-ouvert@tbs-sct.gc.ca</a> and we may be able to post them here as well.
fr: Si vous avez modifié ces instructions d’accès par API pour un autre langage de programmation, veuillez les transmettre à l’adresse <a href="mailto:open-ouvert@tbs-sct.gc.ca">open-ouvert@tbs-sct.gc.ca</a> et nous pourrons peut-être les afficher également ici.

source: Field choices reference
fr: Listes de choix pour les champs

source: Delete existing records
fr: Supprimer les dossiers existants

source: (required)
fr: (obligatoire)

source: Enter one record per line, e.g:
fr: Entrer un (1) dossier par ligne

source: Download template Excel spreadsheet
fr: Télécharger modèle Excel

source: Create and update records from Excel spreadsheet
fr: Créer et mettre à jour les données de la feuille de calcul Excel
